<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3e455687b9326ee3dc66a33040fe39e92d51154d37e26f7dabf9573d243337d8","plan_job_ref":"Job Write Terraform Plan to Pull Request #31 at https://github.com/hackforla/devops-security/actions/runs/7998788944","plan_out_hash":"c1e60ea340d1ba9c27388827cd5de4bc4b1d02a314c06a9592b7254ef3b0337d","plan_hash":"96103aac43d94e1d860a2d4857b3a002e5b4e1e5d28671daef8522f98207ef99","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 3 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.aws_custom_policies.aws_iam_policy.custom_policy["IAMServicesAdmin"] will be created
+   resource "aws_iam_policy" "custom_policy" {
+       arn         = (known after apply)
+       description = "Policy granting IAM services admins permissions to make changes to user accounts"
+       id          = (known after apply)
+       name        = "IAMServicesAdmin"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "iam:CreateAccessKey",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:iam::*:user/*"
                    },
+                   {
+                       Action    = [
+                           "iam:UpdateLoginProfile",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "iam:ResourceTag/Access Level" = [
+                                   "1",
+                                   "2",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:iam::*:user/*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.iam_read_only_group.aws_iam_group_policy_attachment.group_policy_attachment["ReadOnlyAccess"] will be created
+   resource "aws_iam_group_policy_attachment" "group_policy_attachment" {
+       group      = "read-only-group"
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
    }

  # module.iam_services_admin_group.aws_iam_group_policy_attachment.group_policy_attachment["IAMServicesAdmin"] will be created
+   resource "aws_iam_group_policy_attachment" "group_policy_attachment" {
+       group      = "iam-services-admin-group"
+       id         = (known after apply)
+       policy_arn = (known after apply)
    }

  # module.iam_user_abbyz123.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "abbyz123"
        name          = "abbyz123"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.iam_user_awlFCCamp.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "awlFCCamp"
        name          = "awlFCCamp"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.iam_user_brittanyms.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "brittanyms"
        name          = "brittanyms"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.iam_user_freaky4wrld.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "freaky4wrld"
        name          = "freaky4wrld"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.iam_user_samuelusc.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "samuelusc"
        name          = "samuelusc"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.iam_user_shikha0428.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "shikha0428"
        name          = "shikha0428"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

  # module.iam_user_shinjonathan.aws_iam_user.user will be updated in-place
!~  resource "aws_iam_user" "user" {
        id            = "shinjonathan"
        name          = "shinjonathan"
!~      tags          = {
+           "Access Level" = "1"
            "Project"      = "devops-security"
        }
!~      tags_all      = {
+           "Access Level" = "1"
#            (1 unchanged element hidden)
        }
#        (4 unchanged attributes hidden)
    }

Plan: 3 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #31](https://github.com/hackforla/devops-security/actions/runs/7998788944)